{
  "_name_or_path": "lrei/roberta-large-emolit",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "admiration",
    "1": "amusement",
    "2": "anger",
    "3": "annoyance",
    "4": "approval",
    "5": "boredom",
    "6": "calmness",
    "7": "caring",
    "8": "courage",
    "9": "curiosity",
    "10": "desire",
    "11": "despair",
    "12": "disappointment",
    "13": "disapproval",
    "14": "disgust",
    "15": "doubt",
    "16": "embarrassment",
    "17": "envy",
    "18": "excitement",
    "19": "faith",
    "20": "fear",
    "21": "frustration",
    "22": "gratitude",
    "23": "greed",
    "24": "grief",
    "25": "guilt",
    "26": "indifference",
    "27": "joy",
    "28": "love",
    "29": "nervousness",
    "30": "nostalgia",
    "31": "optimism",
    "32": "pain",
    "33": "pride",
    "34": "relief",
    "35": "sadness",
    "36": "surprise",
    "37": "trust"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "admiration": 0,
    "amusement": 1,
    "anger": 2,
    "annoyance": 3,
    "approval": 4,
    "boredom": 5,
    "calmness": 6,
    "caring": 7,
    "courage": 8,
    "curiosity": 9,
    "desire": 10,
    "despair": 11,
    "disappointment": 12,
    "disapproval": 13,
    "disgust": 14,
    "doubt": 15,
    "embarrassment": 16,
    "envy": 17,
    "excitement": 18,
    "faith": 19,
    "fear": 20,
    "frustration": 21,
    "gratitude": 22,
    "greed": 23,
    "grief": 24,
    "guilt": 25,
    "indifference": 26,
    "joy": 27,
    "love": 28,
    "nervousness": 29,
    "nostalgia": 30,
    "optimism": 31,
    "pain": 32,
    "pride": 33,
    "relief": 34,
    "sadness": 35,
    "surprise": 36,
    "trust": 37
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
